app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "firstlast@gmail.com"], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 7]]
---
    def create
        puts(params[:email])
        user = User.find_by(email: params[:user][:email])
        if user && user.authenticate(params[:user][:password])
            render json: {email: user.email, id: user.id, token: encode_token({user_id: user.id}), firstName: user.first_name, lastName: user.last_name, addresses: user.addresses, orders: user.orders}