app/controllers/noodles_controller.rb

    def create
        @noodle = Noodle.create(noodle_params)
---
INSERT INTO "noodles" ("cost", "description", "group", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cost", 13.0], ["description", "miso"], ["group", "noodle"], ["order_id", 26], ["created_at", "2020-07-30 03:54:22.063033"], ["updated_at", "2020-07-30 03:54:22.063033"]]