app/controllers/orders_controller.rb

    def create
        @order = Order.create(order_params)
---
INSERT INTO "orders" ("cost", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cost", 62.5], ["user_id", 7], ["created_at", "2020-07-30 02:56:33.025910"], ["updated_at", "2020-07-30 02:56:33.025910"]]