app/models/order.rb

    def get_cost
        sum = 0.0
        self.noodles.each do |n|
            sum += n.cost
        end
        self.addons.each do |a|
---
SELECT "noodles".* FROM "noodles" WHERE "noodles"."order_id" = $1  [["order_id", 1]]
SELECT "addons".* FROM "addons" INNER JOIN "noodles" ON "addons"."noodle_id" = "noodles"."id" WHERE "noodles"."order_id" = $1  [["order_id", 1]]